app/views/dash/index.html.erb

                                            <% @follower_user.each do |follow|%>
                                                <% @user_follow =  User.find(follow.follower_id)%>
---
SELECT "followers".* FROM "followers" WHERE "followers"."user_id" = $1  [["user_id", 1]]