app/controllers/dash_controller.rb

SELECT COUNT(*) FROM "follows" WHERE "follows"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "snaps" WHERE "snaps"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "followers" WHERE "followers"."user_id" = $1  [["user_id", 1]]
SELECT "followers".* FROM "followers" WHERE "followers"."user_id" = $1  [["user_id", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."user_id" = $1  [["user_id", 1]]
SELECT "snaps".* FROM "snaps" WHERE "snaps"."user_id" = $1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."user_id" = $1 ORDER BY "feeds"."time" DESC  [["user_id", 1]]
---
    def index
        @user = current_user
        @snap_upload = current_user.snaps.new
        @follow_count = current_user.follows.count
        @follower_count = current_user.followers.count
        @follow = current_user.follows.all
        @folloe_user = current_user.follows
        @follower_user = current_user.followers
        @all_snap = Array.new
        @total_snaps = current_user.snaps.count
        current_user.feeds.delete_all
        if @follow.blank?

        else
            @follow.each do |f|
                @curr_user =  User.find(f.follow_id)
                @curr_snap = Snap.where(user_id: f.follow_id)
                @curr_snap.each do |c_s|
                    data = current_user.feeds.new(image: c_s.image, time: c_s.created_at, user_name: @curr_user.user_name, subs_user_id: @curr_user.id)
                    data.save
                    @all_snap.push << data
                end
            end
        end
        puts @all_snap.length
        if current_user.snaps.blank?