app/controllers/login_controller.rb

    def create
        if params[:email].blank?
            flash[:notice] = "email is missing."
            puts "MANU"
            redirect_to login_path
        elsif params[:password].blank?
            puts "ANKU"
            flash[:notice] = "password is missing."
            redirect_to login_path
        elsif params[:email].include?("@")
            puts "PASSS"
            puts params[:password]
            user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "manu@test.com"], ["LIMIT", 1]]