app/controllers/profile_controller.rb

SELECT "snaps".* FROM "snaps" WHERE "snaps"."user_id" = $1  [["user_id", 4]]
SELECT COUNT(*) FROM "snaps" WHERE "snaps"."user_id" = $1  [["user_id", 4]]
---
    def index
        @user= current_user
        @snaps = current_user.snaps.all
        puts @snaps
        @user_snap = current_user.snaps.new
        @total_snap = current_user.snaps.count