app/controllers/register_controller.rb

    def create
      @user_email =  User.find_by(email: user_params[:email])
      @user_name = User.find_by(user_name: user_params[:user_name])
      @user_phone = User.find_by(phone: user_params[:phone])
      if @user_email
        flash[:notice] = "This email is taken by another user"
        redirect_to register_path
      elsif @user_name
        flash[:notice] = "User name is taken by another user"
        redirect_to register_path
      elsif @user_phone
        flash.notice = "Phone number is taken by another user"
        redirect_to register_path
      elsif
        @user = User.new
        @user.first_name = user_params[:first_name]
        @user.last_name = user_params[:last_name]
        @user.phone = user_params[:phone]
        @user.email = user_params[:email]
        @user.password = user_params[:password]
        @user.user_name = user_params[:user_name]
        if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ankku2031@live.com"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "ankku2031"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."phone" = $1 LIMIT $2  [["phone", "9876544545"], ["LIMIT", 1]]
INSERT INTO "users" ("first_name", "last_name", "user_name", "email", "phone", "token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"